__author__  = "Zhu ZhiDong"
__version__ = "1.0"
#
# Configuration Parameters
#
CTL_Default = [
    "80000F0001",   # 主敏感轴

    "80010F0064",   # 力初值波动范围
    "80020F0064",   # X轴加速度初值波动范围
    "80030F0064",   # Y轴加速度初值波动范围
    "80040F0064",   # Z轴加速度初值波动范围
    "80050F9B88",   # 力上限
    "80060F0000",   # 力下限
    "80070F0032",   # 滑动平均点个数V_cnt
    "80080F03E8",   # 初值周期测量时间长度
    "80090F04B0",   # 测量周期时间长度

    "800A0FCCCD",   #
    "800A0F411C",   # 加速度标准参数值
    "800B0F999A",   #
    "800B0F3F99",   # 力最小参数值
    "800C0F1000",   #
    "800C0F3983",   # 加速度最小参数值

    "8000800005",   # 自检力最小值
    "800180FFFA",   # 自检力最大值
    "8002800005",   # 自检X轴加速度最小值
    "800380FFFA",   # 自检X轴加速度最大值
    "8004800005",   # 自检Y轴加速度最小值
    "800580FFFA",   # 自检Y轴加速度最大值
    "8006800005",   # 自检Z轴加速度最小值
    "800780FFFA",   # 自检Z轴加速度最大值
]

CTLParameters = [
    "80000F0002",   # 主敏感轴

    "80010F0096",   # 力初值波动范围
    "80020F0096",   # X轴加速度初值波动范围
    "80030F0096",   # Y轴加速度初值波动范围
    "80040F0096",   # Z轴加速度初值波动范围
    "80050FFFFF",   # 力上限
    "80060F000A",   # 力下限
    "80070F0064",   # 滑动平均点个数V_cnt
    "80080F01F4",   # 初值周期测量时间长度
    "80090F03E8",   # 测量周期时间长度

    "800A0F0000",   #
    "800A0F4120",   # 加速度标准参数值
    "800B0F0000",   #
    "800B0F3F80",   # 力最小参数值
    "800C0FB000",   #
    "800C0F3951",   # 加速度最小参数值

    "8000800064",   # 自检力最小值
    "800180EA60",   # 自检力最大值
    "8002800064",   # 自检X轴加速度最小值
    "800380EA60",   # 自检X轴加速度最大值
    "8004800064",   # 自检Y轴加速度最小值
    "800580EA60",   # 自检Y轴加速度最大值
    "8006800064",   # 自检Z轴加速度最小值
    "800780EA60",   # 自检Z轴加速度最大值
]

CAL_Default = [
    "800071D70A",
    "8000723B23",   # 力值校准参数默认0.0025，实际设置0.002
    "800081D70A",
    "8000823B23",   # X轴加速度校准参数默认0.0025，实际设置0.0002
    "800091126F",
    "8000923983",   # Y轴加速度校准参数默认0.00025，实际设置0.002
    "8000A1126F",
    "8000A23983",   # Z轴加速度校准参数默认0.00025，实际设置0.0002
    "8000B10000",
    "8000B23F80",   # 总线校准参数默认1.0，实际设置0.5
]

CALParameters = [
    "8000711200",
    "8000723B03",   # 力值校准参数默认0.0025，实际设置0.002
    "800081B000",
    "8000823951",   # X轴加速度校准参数默认0.0025，实际设置0.0002
    "8000911200",
    "8000923B03",   # Y轴加速度校准参数默认0.00025，实际设置0.002
    "8000A1B000",
    "8000A23951",   # Z轴加速度校准参数默认0.00025，实际设置0.0002
    "8000B10000",
    "8000B23F00",   # 总线校准参数默认1.0，实际设置0.5
]

BAT_Default = [
    "8003C001F4",   # 满格电池电量阈值默认500，实际设置600
    "8004C00190",   # 两格电池电量阈值默认400，实际设置450
    "8005C00064",   # 一格电池电量阈值默认100，实际设置150
    "8006C00014",   # 电池电量检查周期默认20，实际设置50
]

BATParameters = [
    "8003C00258",   # 满格电池电量阈值默认500，实际设置600
    "8004C001C2",   # 两格电池电量阈值默认400，实际设置450
    "8005C00096",   # 一格电池电量阈值默认100，实际设置150
    "8006C00032",   # 电池电量检查周期默认20，实际设置50
]

# -------------------------------- End of file --------------------------------
